Revit 2027 API
ForgeTypeId.LessThan Operator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool operator <(
	ForgeTypeId lhs,
	ForgeTypeId rhs
)
Public Shared Operator < (
	lhs As ForgeTypeId,
	rhs As ForgeTypeId
) As Boolean
public:
static bool operator <(
	ForgeTypeId^ lhs,
	ForgeTypeId^ rhs
)
static let inline (<)
        lhs : ForgeTypeId *
        rhs : ForgeTypeId  : bool
Parameters
lhs ForgeTypeId
rhs ForgeTypeId
Return Value
Boolean
See Also
Reference
ForgeTypeId Class
Autodesk.Revit.DB Namespace